#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

Show Plan

```terraform
data.cloudflare_zone.lilja_dot_io: Reading...
data.cloudflare_zone.lilja_dot_io: Read complete after 0s [id=801ec7bc35b2abc9580d847c7b5c6f56]
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"]: Refreshing state... [id=17f1e94ab3576c93296900f09c2cad2f]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"]: Refreshing state... [id=ddb7f0e8bcc1a92e83459eb5643e2827]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_record["@-v=spf1 include:_spf.protonmail.ch mx ~all"]: Refreshing state... [id=27880e7ae87be1c5dcdde52d5763dfb4]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_record["_dmarc-v=DMARC1; p=quarantine"]: Refreshing state... [id=34dcc8e8ec712be680b004d4071f5a89]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"]: Refreshing state... [id=e8665c888f0006a9b36f38ae80b860d1]
module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"]: Refreshing state... [id=cd3bbd6e0352097c0c5651ff95a37988]
module.cloudflare_lilja_io_setup.cloudflare_record.txt_record["@-protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d"]: Refreshing state... [id=91f6606f599ea13775f2eab5d362c384]
module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"]: Refreshing state... [id=2b9dab6700df6f8a389c327483b1a045]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"] must be replaced
-/+ resource "cloudflare_record" "mx_proton_mail" {
      ~ created_on      = "2025-02-01T20:41:00.745141Z" -> (known after apply)
      ~ hostname        = "lilja.io" -> (known after apply)
      ~ id              = "17f1e94ab3576c93296900f09c2cad2f" -> (known after apply)
      ~ metadata        = {} -> (known after apply)
      ~ modified_on     = "2025-02-01T20:41:00.745141Z" -> (known after apply)
      ~ name            = "lilja.io" -> "@" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - tags            = [] -> null
      + value           = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"] must be replaced
-/+ resource "cloudflare_record" "mx_proton_mail" {
      ~ created_on      = "2025-02-01T20:40:59.979317Z" -> (known after apply)
      ~ hostname        = "lilja.io" -> (known after apply)
      ~ id              = "2b9dab6700df6f8a389c327483b1a045" -> (known after apply)
      ~ metadata        = {} -> (known after apply)
      ~ modified_on     = "2025-02-01T20:40:59.979317Z" -> (known after apply)
      ~ name            = "lilja.io" -> "@" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - tags            = [] -> null
      + value           = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_record["@-protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d"] must be replaced
  # (moved from module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_protomain_verification)
-/+ resource "cloudflare_record" "txt_record" {
      ~ created_on      = "2025-02-01T20:40:56.728774Z" -> (known after apply)
      ~ hostname        = "lilja.io" -> (known after apply)
      ~ id              = "91f6606f599ea13775f2eab5d362c384" -> (known after apply)
      ~ metadata        = {} -> (known after apply)
      ~ modified_on     = "2025-02-01T20:40:56.728774Z" -> (known after apply)
      ~ name            = "lilja.io" -> "@" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      + value           = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_record["@-v=spf1 include:_spf.protonmail.ch mx ~all"] must be replaced
  # (moved from module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_spf1)
-/+ resource "cloudflare_record" "txt_record" {
      ~ created_on      = "2025-02-01T20:40:59.49959Z" -> (known after apply)
      ~ hostname        = "lilja.io" -> (known after apply)
      ~ id              = "27880e7ae87be1c5dcdde52d5763dfb4" -> (known after apply)
      ~ metadata        = {} -> (known after apply)
      ~ modified_on     = "2025-02-01T20:40:59.49959Z" -> (known after apply)
      ~ name            = "lilja.io" -> "@" # forces replacement
      ~ proxiable       = false -> (known after apply)
      - tags            = [] -> null
      ~ ttl             = 1 -> (known after apply)
      + value           = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_dmarc has moved to module.cloudflare_lilja_io_setup.cloudflare_record.txt_record["_dmarc-v=DMARC1; p=quarantine"]
    resource "cloudflare_record" "txt_record" {
        id              = "34dcc8e8ec712be680b004d4071f5a89"
        name            = "_dmarc"
        tags            = []
        # (12 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```

*Pusher: @jlilja, Action: `pull_request`, Workflow: `Plan Terraform code on PR`*